export interface questionData {
  questionNumber: number;
  question: string;
  type: "multiple-choice" | "text-input" | "ox";
  options?: string[];
  rationale?: string[];
  correctAnswer: number | string;
  commentary?: string;
  hint?: string;
  image?: any;
  tag: string[];
  description?: string;
  guide?: string;
}

export const questionData: questionData[] = [
  {
    questionNumber: 1,
    question: `다음 중, 음운의 개수가 변하는 것은?`,
    type: "multiple-choice",
    options: ["개미", "섣달", "추후", "예뻐서", "안녕"],
    rationale: [
      "개미는 발음이 [개미]이므로 음운 변동이 일어나지 않습니다.",
      "섣달은 경음화 현상에 의해 [섣딸]이 되지만, 쌍자음은 음운 첨가가 아닌 교체이므로 개수가 변하지 않습니다.",
      "추후는 발음이 [추후]이므로 음운 변동이 일어나지 않습니다.",
      "예뻐서는 예쁘다의 어간 '예쁘-'에 어미 '-어서'가 결합된 형태인데, 모음 ㅡ와 ㅓ가 만나 ㅡ가 탈락이 일어나므로 음운의 개수가 변합니다.",
      "안녕은 발음이 [안녕]이므로 음운 변동이 일어나지 않습니다.",
    ],
    hint: "교체는 음운의 개수가 변하지 않습니다.",
    correctAnswer: 4,
    tag: ["보통", "고등", "음운 변동", "탈락"],
  },
  {
    questionNumber: 2,
    question: "다음 중, 사진과 연상되는 속담은?",
    type: "multiple-choice",
    options: [
      "가는 말이 고와야 오는 말도 곱다",
      "발 없는 말이 천 리 간다",
      "제 버릇 개 줄까",
      "소 잃고 외양간 고친다",
      "꿈보다 해몽이 좋다",
    ],
    correctAnswer: 4,
    commentary: `'소 잃고 외양간 고친다'라는 말이 나오게 된 배경을 보면 했어야 할 일을 제때 하지 않고 사건이 일어난 후에 해결하는 모습이 떠오릅니다.
일이 잘못된 후에는 다시 되돌릴 수 없다는 의미를 가지고 있습니다.
사진을 보시면 소는 이미 나와 있는데 외양간을 고치려는 모습을 볼 수 있습니다. 그래서 정답은 4번이 되겠습니다.`,
    hint: "사진에 있는 동물이 무엇인지 보면 쉽게 맞힐 수 있습니다.",
    // image: require("@assets/images/cowboy.jpg"),
    tag: ["기초", "일반", "속담"],
  },
  {
    questionNumber: 3,
    question: "/_심심한 사과의 말씀을 드립니다._/\n위 맥락에서의 심심하다는?",
    type: "multiple-choice",
    options: [
      "하는 일이 없어 지루하고 재미가 없다.",
      "음식 맛이 조금 싱겁다.",
      "마음의 표현 정도가 매우 깊고 간절하다.",
      "깊고 깊다.",
      "마음으로 받아들여 깨닫다.",
    ],
    correctAnswer: 3,
    commentary: `과거에 유명했던 어휘력 부족으로 인한 세대 간의 갈등을 보여 주는 예입니다.
어떤 표현이 있을 때에는 자신이 알고 있는 어휘 내에서만 파악하려 하기보단 상대방의 의도가 무엇인지를 파악하는 게 중요합니다.
문장을 해석하실 때는 상황 맥락과 문장의 내용을 보고 다른 의미가 있지 않을까 생각해 보았으면 합니다.`,
    hint: "심심하다와 사과의 연관성을 찾아보세요.",
    tag: ["보통", "일반", "어휘"],
  },
  {
    questionNumber: 4,
    question: "/_어떤 일을 몹시 즐겨서 거기에 빠지다._/\n이를 의미하는 단어는?",
    type: "text-input",
    correctAnswer: "탐닉하다",
    commentary: `'탐닉하다'는 '중독되다'와 비슷하지만 '중독되다'는 보통 부정적으로 쓰입니다.
'탐닉하다'의 경우에는 평서문에 주로 쓰는 단어로 볼 수 있습니다.
참고로, '탐닉되다'는 표준 국어 대사전 기준, 표준어가 아닙니다. '탐닉하다'로만 씁니다.`,
    hint: "한자어입니다.",
    tag: ["어려움", "일반", "어휘"],
    guide: "어떤 일을 몹시 즐겨서 거기에 빠지다.",
  },
  {
    questionNumber: 5,
    question: "/_굳히다_/의 발음은 [구티다]이다.",
    type: "ox",
    correctAnswer: "X",
    commentary: `'굳히다'는 격음화 현상(거센소리되기)에 의해 [구티다]가 되는데
'ㅌ'과 'ㅣ'가 만났고 '-히-'가 형식 형태소이므로 구개음화 현상이 일어나 [구치다]가 됩니다.`,
    hint: "-히-는 형식 형태소입니다.",
    tag: ["기초", "중/고등", "음운 변동", "구개음화"],
  },
  {
    questionNumber: 6,
    question: `우리나라가 2년 만(에/의) 월드컵에서 우승하였다.
월드컵이 2년 만에 개최됐다는 맥락일 때 이 중 알맞은 것은?`,
    type: "text-input",
    correctAnswer: "의",
    commentary: `우리나라가 2년 만(에/의) 월드컵에서 우승하였다.
월드컵이 2년 만에 개최됐다는 것이 중점이면, 관형격 조사 '의'가 붙어 월드컵을 수식해야 합니다.
한편, '에'로 쓴다면 우리나라가 월드컵에서 우승한 것이 2년 만이라는 의미입니다.`,
    guide: `우리나라가 2년 만(에/의) 월드컵에서 우승하였다.`,
    tag: ["어려움", "일반", "조사"],
  },
  {
    questionNumber: 7,
    question: "다음 중 표준어가 /*아닌*/ 것은?",
    type: "multiple-choice",
    options: ["준수", "엔간하다", "밥도둑", "쳐먹다", "대관절"],
    correctAnswer: 4,
    commentary: `①②③⑤ 준수, 엔간하다, 밥도둑, 대관절은 모두 표준어입니다.
④ '쳐먹다'는 '처먹다'의 잘못입니다. 접두사 '처-'에 '먹다'가 결합된 구성이 바람직합니다.`,
    hint: "단어 중 사전에 등재되지 않은 접사가 있습니다.",
    tag: ["보통", "일반", "어휘", "맞춤법", "접사"],
  },
  {
    questionNumber: 8,
    question: `이 문단의 중심 문장을 찾아 /_첫 낱말_/을 써 보세요.`,
    type: "text-input",
    correctAnswer: "여름",
    commentary: `자두와 살구, 복숭아의 경우 모두 과일을 의미하니 '여름이 되면 우리 마을에 탐스러운 과일이 열립니다' 부분이 중심 문장이라고 볼 수 있습니다.`,
    hint: "어떤 단어를 분류하는 말을 보시면 됩니다.",
    description:
      "우리 마을에는 새콤달콤한 자두가 탐스럽게 익어 갑니다. 그리고 살구나무에는 살구가 주렁주렁 달립니다. 과수원에는 달콤한 복숭아가 열립니다. 여름이 되면 이처럼 우리 마을에는 탐스러운 과일이 열립니다.",
    tag: ["보통", "초등", "문법"],
    guide: `'사람은 누구나 늙는다'가 중심 문장이면 '사람'으로 적습니다.`,
  },
  {
    questionNumber: 9,
    question: "다음 중, 호응 관계가 맞지 /*않은*/ 문장은?",
    type: "multiple-choice",
    options: [
      "김민우는 생물학적으로 남자다.",
      "황현민은 애들을 괴롭히기 때문에 못된 사람이다.",
      "강민석은 우리 학교에 차석으로 입학한 사람이기에 똑똑하다.",
      "이지석이 이지적이지 않은지는 잘 모르겠다.",
      "강승훈은 실력과 외모가 높아 사람들에게 인정받았다.",
    ],
    correctAnswer: 5,
    commentary: `⑤ 강승훈은 실력과 외모가 높아 사람들에게 인정받았다.
외모는 높다고 표현할 수 없습니다.
둘을 문장상에 두고 싶다면 실력이 높고 외모가 출중하다와 같이 쓰셔야 합니다.`,
    hint: "명사와 동사가 서로 맞지 않는 문장이 있습니다.",
    tag: ["기초", "초등", "문법"],
  },
  {
    questionNumber: 10,
    question: "다음 중, 역설법이 사용된 것으로 알맞지 /*않은*/ 것은?",
    type: "multiple-choice",
    options: [
      "소리 없는 아우성",
      "아아, 님은 갔지만 나는 님을 보내지 아니하였습니다.",
      "찬란한 슬픔의 봄",
      "괴로웠던 사나이 / 행복한 예수 그리스도에게처럼",
      "뼈에 저리도록 생활은 슬퍼도 좋다.",
    ],
    correctAnswer: 5,
    commentary: `⑤ '생활은 슬퍼도 좋다' 부분에서 반어법이 사용되었습니다.
슬픔과 좋다는 서로 양립할 수 없으나 이 표현을 토대로 고통스러운 현실 속에서도 절망하지 않는 의지를 드러냅니다.`,
    hint: "역설은 일반적인 경우에는 모순되지 않지만 특정한 경우에서 논리적 모순을 드러내 표현하지만 반어는 현재 실정과 반대되는 뜻의 말을 통해 표현합니다.",

    tag: ["어려움", "중등", "문학", "수사법"],
  },
  {
    questionNumber: 11,
    question: "다음 중 강조법이 /*아닌*/ 것은?",
    type: "multiple-choice",
    options: ["과장법", "미화법", "대구법", "영탄법", "점강법"],
    correctAnswer: 3,
    commentary: `대구법은 비슷한 가락을 짝지어 표현하므로 변화법입니다.
변화법은 문장의 단조로움을 피하려고 쓰는 표현법입니다.`,
    hint: "위 표현법 사이에 변화법이 존재합니다.",
    tag: ["기초", "중등", "수사법"],
  },
  {
    questionNumber: 12,
    question: "수사법 중 /_대구법_/의 발음은 [대꾸뻡]이다.",
    type: "ox",
    correctAnswer: "O",
    commentary: `수사법에서의 대구는 [대구]가 아니고 [대꾸]로 발음합니다.
다만, 물고기 종류를 의미하는 대구는 [대구]로 발음합니다.`,
    tag: ["보통", "일반", "음운 변동"],
  },
  {
    questionNumber: 13,
    question: "/_2, 3, 5_/ 등을 의미하는 소수의 발음은 [소수]이다.",
    type: "ox",
    correctAnswer: "X",
    commentary: `2, 3, 5 등을 의미하는 소수의 발음은 [소쑤]입니다.
0.1, 0.5와 같은 소수가 [소수]로 발음됩니다.`,
    tag: ["보통", "일반", "음운 변동"],
  },
];
